НП/src/Documents/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвиженияДенежныхСредств</name>
  <comment>Поступление/расход денежных средств</comment>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперцийДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

НП/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

НП/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
      <types>DocumentRef.Посещение</types>
      <types>DocumentRef.ПродажаАбонемента</types>
      <types>DocumentRef.РеализацияТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

НП/src/Enums/ВидыОперцийДвиженияДенежныхСредств/ВидыОперцийДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперцийДвиженияДенежныхСредств</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

НП/src/Documents/ДвиженияДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Денежные средства
	ТаблицаДС = СоздатьТаблицуДенежныхСредств();
	Если ТаблицаДС.Количество()>0 Тогда
		СформироватьДвиженияПоРегистру(ТаблицаДС, Отказ, "ДенежныеСредства", , ?(ВидОперации = Перечисления.ВидыОперцийДвиженияДенежныхСредств.Приход,"Приход","Расход"));
	КонецЕсли;
	
	//Взаиморасчеты
	Если ВидОперации = Перечисления.ВидыОперцийДвиженияДенежныхСредств.Расход Тогда
		ТаблицаВзаиморасчетов = СоздатьТаблицуДолгаПоДокументам();
		СформироватьДвиженияПоРегистру(ТаблицаВзаиморасчетов, Отказ, "Взаиморасчеты", Истина);
	Иначе
		ТаблицаОплат		  = СоздатьТаблицуОплатПоДокументам();
		СформироватьДвиженияПоРегистру(ТаблицаОплат, Отказ, "Взаиморасчеты", , "Расход");
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьДвиженияПоРегистру(Таблица, Отказ, ИмяРегистра, ПромежуточноЗаписать=Ложь, ВидДвижения = "Приход")

	// ПО РЕГИСТРУ Взаиморасчеты.
	
	НаборДвижений = Движения[ИмяРегистра];
	НаборДвижений.Записывать = Истина;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	// Заполним таблицу движений.
	ОбщегоНазначенияНП.ЗагрузитьВТаблицуЗначений(Таблица, ТаблицаДвижений);
	
	// Недостающие поля.
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		
		Если ВидДвижения = "Приход" Тогда
			НаборДвижений.ВыполнитьПриход();
		ИначеЕсли ВидДвижения = "Обороты" Тогда
			НаборДвижений.ВыполнитьДвижения();
		Иначе
			НаборДвижений.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПромежуточноЗаписать ТОгда
		НаборДвижений.Записать();
	КонецЕсли;
КонецПроцедуры

Функция СоздатьТаблицуДенежныхСредств()
	
	ТаблицаДвижений = Движения.ДенежныеСредства.Выгрузить();
	ТаблицаДвижений.Очистить();
	НовСтр = ТаблицаДвижений.Добавить();
	
	НовСтр.Сумма = Сумма;
	Если НовСтр.Сумма = 0 Тогда
		ТаблицаДвижений.Удалить(НовСтр);
	КонецЕсли;
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция СоздатьТаблицуОплатПоДокументам()
	
	ТаблицаДвижений = Движения.Взаиморасчеты.Выгрузить();
	ТаблицаДвижений.Очистить();
	НовСтр = ТаблицаДвижений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр,ЭтотОбъект);
	НовСтр.СуммаВзаиморасчетов = ?(ВидОперации=Перечисления.ВидыОперцийДвиженияДенежныхСредств.Приход,Сумма,0);
	Если НовСтр.СуммаВзаиморасчетов = 0 Тогда
		ТаблицаДвижений.Удалить(НовСтр);
	КонецЕсли;
	
	НовТаблицаДвижений = ДобавленныеФункции.РаспределитьОплатуПоРасчетнымДокументам(Ссылка, ТаблицаДвижений, Истина);
	
	Возврат НовТаблицаДвижений;
	
КонецФункции

Функция СоздатьТаблицуДолгаПоДокументам()
	
	ТаблицаДвижений = Движения.Взаиморасчеты.Выгрузить();
	ТаблицаДвижений.Очистить();
	НовСтр = ТаблицаДвижений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр,ЭтотОбъект);
	НовСтр.СуммаВзаиморасчетов = ?(ВидОперации=Перечисления.ВидыОперцийДвиженияДенежныхСредств.Расход,Сумма,0);
	Если НовСтр.СуммаВзаиморасчетов = 0 Тогда
		ТаблицаДвижений.Удалить(НовСтр);
	КонецЕсли;
	
	НовТаблицаДвижений = ДобавленныеФункции.РаспределитьОплатуПоРасчетнымДокументам(Ссылка, ТаблицаДвижений, Ложь);
	
	Возврат НовТаблицаДвижений;
	
КонецФункции
